import pytest

from flat_parser.utils.data import (
    normolize_address_for_domaekb,
    get_meter_price,
    get_time_in_minutes_by_text
)


@pytest.mark.parametrize('address, expected', [
    ('Первомайская улица., 79', 'Первомайская ул., 79'),
    ('ул. Начдива Онуфриева, 24к2', 'ул. Начдива Онуфриева, 24/2'),
    ('проспект Академика Сахарова , 2', 'пр-кт Академика Сахарова , 2'),
    ('пр-т Академика Сахарова , 2', 'пр-кт Академика Сахарова , 2'),
    ('пр Академика Сахарова , 2', 'пр-кт Академика Сахарова , 2'),
    ('Россия, Екатеринбург, Бессарабская ул, 10А', 'Бессарабская ул, 10А'),
    ('Екатеринбург, Россия Байкальская ул, 35', 'Байкальская ул, 35'),
    ('Екатеринбург, Водоемная ул, 80 корпус 3', 'Водоемная ул, 80/3'),
    ('Аппаратная станция 6', 'Аппаратная 6'),
    ('Россия, Свердловская область, городской округ Екатеринбург, Екатеринбург, улица Данилы Зверева, 7в', 'ул Данилы Зверева, 7в'),
    ('Базовый переулок, 50', 'Базовый пер., 50'),
    ('ул Начдива Онуфриева, 32 ст1', 'ул Начдива Онуфриева, 32/1'),
    ('Россия, Свердловская область, Екатеринбург, Екатеринбург, ул. Краснолесье, 149, Свердловская обл., Россия', 'ул. Краснолесье, 149'),
    ('Екатеринбург, 139 улица Луначарского', '139 ул Луначарского'),
    ('ул Бажова, д103', 'ул Бажова, 103'),
    (None, None),
    ('', '')
])
def test_get_normalize_address(address, expected):
    assert expected == normolize_address_for_domaekb(address)


@pytest.mark.parametrize('data, meter_price', [
    ({'total_area': '50.3', 'price': str(4_000_205)}, str(79_526.93837))
])
def test_get_meter_price(data, meter_price):
    assert meter_price == get_meter_price(data)


@pytest.mark.parametrize('text, time', [
    ('', 0),
    (None, None),
    ('45 мин.', 45),
    ('1 ч. 20 мин.', 80),
    ('2 ч.', 120),
    ('1 д.', 1440),
    ('2 д. 2 ч. 10 мин.', 3010)
])
def test_get_time_in_minutes_by_text(text, time):
    assert time == get_time_in_minutes_by_text(text)
